'use client'

export function Summary() {
  return (
    <div className='w-full lg:px-[160px] lg:py-[84px] md:py-[40px] md:px-[56px] xs:px-[16px] xs:py-[56px] xl:px-[240px] xl:py-[84px] bg-white flex justify-center items-center'>
      <div className='flex flex-col justify-between items-start w-full lg:gap-[266px] md:gap-[88px] xs:gap-[20px] xl:gap-auto xs:flex-col md:flex-row'>
        <svg xmlns='http://www.w3.org/2000/svg' className='w-auto h-[40px] md:h-[60px] lg:h-[74px] xl:h-[72.321px]' viewBox='0 0 187 40' fill='none'>
          <path d='M77.001 36.5623H78.0891V39H78.9146V36.5623H80.001V36H77.001V36.5623Z' fill='#222222' />
          <path
            d='M82.358 36L81.7527 37.9027L81.1422 36H80.001V39H80.745V36.9305L81.3711 39H82.1239L82.7552 36.9291V39H83.501V36H82.358Z'
            fill='#222222'
          />
          <path
            d='M7.74999 40C12.6536 40 15.5 37.2398 15.5 32.4522V26.1974C15.5 22.3662 14.168 20.0574 10.8974 18.0851L7.62672 16.1129C5.87213 15.0419 5.20455 13.8592 5.20455 11.7186V8.0006C5.20455 5.2955 5.87213 4.28108 7.62672 4.28108C9.38131 4.28108 10.0489 5.2955 10.0489 8.0006V12.2832H15.0757V7.32581C15.0757 2.7051 12.2325 0 7.50825 0C2.78398 0 0 2.7051 0 7.32284V12.0001C0 15.8329 1.33356 18.1432 4.60421 20.1125L7.87326 22.0847C9.62785 23.1542 10.2954 24.3369 10.2954 26.4775V31.6613C10.2954 34.5898 9.56702 35.7174 7.63152 35.7174C5.69603 35.7174 5.02845 34.5913 5.02845 31.6613V25.8012H0.00160247V32.4507C0.00160247 37.2398 2.84962 40 7.75319 40H7.74999Z'
            fill='#222222'
          />
          <path
            d='M43.691 28.1004C46.7775 35.1975 54.7587 40 63.5533 40C72.9481 40 80.4263 34.309 83.6959 24.7321L83.828 24.3331C83.8646 24.2189 83.9044 24.1062 83.941 23.992L83.9999 23.8036H83.4491L82.7105 23.7992L82.6755 23.903C79.7832 32.4847 73.1646 37.8168 65.524 37.8168C61.2436 37.8168 55.8554 36.0503 52.8199 32.9727C49.3975 29.5035 47.5909 24.6728 47.5909 19.0055C47.5909 7.38181 56.4874 1.6493 64.6294 1.6493C70.7403 1.6493 73.2935 5.35133 72.8414 9.24321C72.3432 13.5311 70.7912 16.7111 70.4538 17.2865H72.0997L78.4716 5.17335L78.5082 5.0977L78.4557 5.03096C77.5945 3.88742 75.9932 2.75724 74.0576 1.92962C71.4996 0.835034 68.5006 0 65.1451 0C58.8528 0 52.5541 2.04679 48.4966 5.76514C45.1825 8.80122 43.0813 12.8459 42.4175 17.3755C42.3857 17.463 42.3459 17.4808 42.3045 17.291L40.2225 0.556194H33.2982L28.9987 35.1144H21.6797V0.556194H16.5V39.2629H33.4176L34.3806 30.2881H38.8376L39.8006 39.2629H45.0376L43.6512 28.1256M34.7356 26.1382L36.5438 5.94164H36.6632L38.4715 26.1382H34.7372H34.7356ZM43.6496 28.1256L43.6273 27.9462C43.648 27.9966 43.6687 28.0485 43.6894 28.1004'
            fill='#222222'
          />
        </svg>

        <div className='flex-1 flex flex-col xs:gap-[16px] lg:gap-[16px]'>
          <div className='flex flex-col xs:gap-[36px] md:gap-[8px] lg:gap-[16px]'>
            <div className='flex flex-col'>
              <h1 className='text-neutral-800 xs:text-[28px] md:text-[24px] lg:text-[28px] font-bold leading-tight'>
                슬랙
              </h1>
              <h2 className='text-neutral-800 xs:text-[28px] md:text-[24px] lg:text-[28px] font-bold leading-tight'>
                Slate for Own Scene
              </h2>
            </div>

            <div className='w-full'>
              <p className='text-neutral-800 text-base xs:text-[17px] md:text-[18px] lg:text-[22px] font-medium leading-relaxed'>
                Slac은 언제나 소리와 함께하는 Z세대가 소리로 '나의 순간'에 몰입하는 방법을 제안합니다. 모든 순간 나를
                가장 가까이서 이해하는 웨어러블 오디오를 통해 나와 닮아가는 소리는 마치 나에게 딱 맞는 옷을 입는 것처럼
                변화합니다. Slac과 함께 디렉터가 되어, 소리로 완성되는 나만의 #Scene을 만나보세요!
              </p>
            </div>
          </div>

          <div className='w-full'>
            <p className='text-zinc-600 text-sm md:text-base opacity-70 xs:text-[14px] md:text-[14px] lg:text-[18px]'>
              김민채, 김민채, 김민채, 김민채, 김민채
            </p>
          </div>
        </div>
      </div>
    </div>
  )
}
